src/MLearn/RANSTemp/peHill/cell14751/template/0/Tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(3.576819822853558819e-06 -5.879402869727005695e-08 0.000000000000000000e+00 4.111198006650804570e-08 0.000000000000000000e+00 1.078048030165558568e-06)
(1.090936454044561198e-05 -1.793342837927173604e-07 0.000000000000000000e+00 1.253956039801940002e-07 0.000000000000000000e+00 3.288057912748934375e-06)
(1.867384466020027888e-05 -3.074596640112380365e-07 0.000000000000000000e+00 2.147850120606723789e-07 0.000000000000000000e+00 5.627917798481418288e-06)
(2.683319755292037120e-05 -4.423298044921889763e-07 0.000000000000000000e+00 3.087869760052073896e-07 0.000000000000000000e+00 8.086616508040466957e-06)
(3.542192261816109479e-05 -5.842852194552641362e-07 0.000000000000000000e+00 4.077321330233131199e-07 0.000000000000000000e+00 1.067470839100396930e-05)
(4.444001985592323570e-05 -7.333259089004764864e-07 0.000000000000000000e+00 5.116204831149985694e-07 0.000000000000000000e+00 1.339219344737216163e-05)
(5.591355018335282702e-05 -9.038304091579062268e-07 0.000000000000000000e+00 6.982673925010712678e-07 0.000000000000000000e+00 1.626551557520354352e-05)
(6.558715549177250072e-05 -1.043692901842117442e-06 0.000000000000000000e+00 9.333825061168972127e-07 0.000000000000000000e+00 1.932231690522861025e-05)
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            zeroGradient;
    }
}